#include<stdio.h>
#define WITDH 10
#define HEIGHT 10

char maze[WITDH][HEIGHT] =
{
	{'1','0','1','1','1','1','1','1','1','1' },
	{'1','0','0','0','0','0','0','0','0','1' },
	{'1','0','1','1','1','0','1','1','1','1' },
	{'1','1','1','1','0','0','1','0','0','0' },
	{'1','1','0','0','0','1','1','0','1','1' },
	{'1','1','0','1','1','1','1','0','1','1' },
	{'1','1','0','1','1','1','1','0','1','1' },
	{'1','0','0','0','0','0','0','0','1','1' },
	{'1','0','1','1','1','1','1','1','1','1' },
	{'1','1','1','1','1','1','1','1','1','1' },

};

void Render()
{

	for (int i = 0; i < WITDH; i++)
	{
		for (int j = 0; j < HEIGHT; j++)
		{
			if (maze[i][j] == '0')
			{
				printf("  ");
			}
			else if (maze[i][j] == '1')
			{
				printf("■");
			}



		}

		printf("\n");

	}

}


int main()
{
#pragma region (2)차원 배열
	// 배열의 요소로 또 다른 배열을 가리는 배열입니다.

	// int array2D[3][3]=
	// {
	// 	{1,2,3},
	// 	{4,5,6},
	// 	{7,8,9},
	// };
	// 
	// 
	// for (int i = 0; i<3; i++)
	// {
	// 	for (int j = 0; j < 3; j++)
	// 	{
	// 		printf("%d", array2D[i][j]);
	// 	}
	// 
	// 	printf("\n");
	// }

	// while (array2D[0][0])
	// {
	// 	printf("2차원배열\n", array2D[0][0]);
	// 	if (array2D[1][1])
	// 	{
	// 		printf("행과열 1,1로 이동\n", array2D[1][1]);
	// 	}
	// }
	// for (i=0;i<10;i++)
	// {
	// 
	// 
	// }

	// 2차원 배열은 행과 열로 구분되며 앞에 있는 배열은
	// 열을 의미하고, 뒤에 있는 배열은 행을 의미합니다.

#pragma endregion


	Render();

	return 0;
}